{
  
    "SidebarLinks": [
      { "title1": "About" },
      { "title2": "Projects" },
      { "title3": "Training" }
    ],
    "ProjectsData": [
      {
        "description1": "BookWise is an online library platform that allows students to borrow books with administrator permission. It includes advanced features: advanced backend, JWT authentication, inactivity and welcome emails, Rate Limiting, role-based permissions, and book creation by the admin."
      },
      {

        "description2": "My personal portfolio. This project strengthened my skills in design and smooth animations using Motion, MagicUI, and Next-Intl for internationalization."
      },
      {

        "description3": "A Netflix clone where users can search for movies and series and view details. This project enhanced my skills in API handling, data fetching, and search/filter algorithms."
      },
      {

        "description4": "A landing page presenting a shoe selling platform. This project helped me improve my design skills and create fast and high-performance sites."
      }
    ],
    "Formations": [
      {
        "bootcamp1": "Backend JavaScript Developer Program",
        "centre1": "Orange Digital Center",
        "description1": "An accelerated training in backend web development with JavaScript. This program deepened my understanding of backend concepts with JavaScript frameworks through concrete projects."
      },
      {
        "bootcamp2": "UI/UX Training with Figma",
        "centre2": "Orange Digital Center",
        "description2": "A hands-on workshop on UI/UX design using Figma. I learned how to mockup and prototype applications before development and mastered Figma for creating modern and intuitive designs."
      },
      {
        "bootcamp3": "Fullstack Web Development",
        "centre3": "Self-Taught",
        "description3": "Since 2022, I have been self-learning fullstack web development through platforms like Udemy, JavaScript Mastery, and Grafikart. This allowed me to master React and Next.js, a stack I particularly enjoy."
      }
    ],
    "Experiences": [
      {
        "post1": "Fullstack Web Developer",
        "description1": "Design and development of SEO-optimized, high-performance, and scalable applications and websites for individuals and businesses using modern stacks like Next.js, Shadcn UI, PostgreSQL, and Upstash with smooth animations."
      },
      {
        "post2": "Frontend Developer",
        "description2": "Design and development of an SEO-optimized and high-performance site for Falcong Technologie using React.js, TailwindCSS for styling, and Framer Motion for smooth animations."
      },
      {
        "post3": "Fullstack Web Developer",
        "description3": "Design and development of SEO-optimized and high-performance applications and websites for individuals and SMEs using PHP for the backend and JavaScript/Bootstrap for smooth interfaces."
      }
    ]
  
}