 {
    
    "SidebarLinks": [
      { "title": "Auteur", "href": "#auteur" },
      { "title": "Projets", "href": "#project" },
      { "title": "Formations", "href": "#formation" }
    ],
    "ProjectsData": [
      {

        "description1": "BookWise est une plateforme de bibliothèque en ligne permettant aux étudiants d'emprunter des livres avec autorisation de l'administrateur. Elle inclut des fonctionnalités avancées : Backend évolué, authentification via JWT, emails d'inactivité et de bienvenue, Rate Limiting, permissions par rôle, création de livres par l'administrateur."
        
      },
      {
        "description2": "Mon portfolio personnel. Ce projet a renforcé mes compétences en design et en animations fluides grâce à Motion, MagicUI, et Next-Intl pour l'internationalisation."

      },
      {

        "description3": "Clone de Netflix où les utilisateurs peuvent rechercher des films et séries et en voir les détails. Ce projet a renforcé mes compétences en manipulation d'API, en fetching de données, en algorithmes de recherche et de filtrage."

      },
      {

        "description4": "Une landing page pour la présentation d'une plateforme de vente de chaussures. Ce projet m'a permis d'améliorer mes compétences en design et en création de sites rapides et performants."
       
      }
    ],
    "Formations": [
      {
        "bootcamp1": "Parcours Développeur Backend JavaScript",
        "centr1": "Orange Digital Center",
        "description1": "Formation accélérée en développement web backend avec JavaScript. Ce parcours m'a permis d'approfondir les concepts backend avec les frameworks JavaScript à travers des projets concrets."
        
      },
      {
        "bootcamp2": "Parcours UI/UX avec Figma",
        "centre2": "Orange Digital Center",
        "description2": "Atelier pratique sur la conception UI/UX avec Figma. J'y ai appris à maquetter et à prototyper mes applications avant le développement et à maîtriser Figma pour créer des designs modernes et intuitifs."
        
      },
      {
        "bootcamp3": "Développement Web Fullstack",
        "centre3": "Autodidacte",
        "description3": "Depuis 2022, j'apprends en autodidacte le développement web fullstack via des plateformes comme Udemy, JavaScript Mastery et Grafikart. Cela m'a permis de maîtriser React et Next.js, une stack que j'apprécie particulièrement."
        
      }
    ],
    "Experiences": [
      {
        "post1": "Développeur Web Fullstack",
        "entreprise1": "Freelance",
        "description1": "Conception et développement d'applications et de sites web SEO optimisés, performants et scalables pour particuliers et entreprises. J'utilise des stacks modernes comme Next.js, Shadcn UI, PostgreSQL, Upstash, avec des animations fluides."
        
      },
      {
        "post2": "Développeur Frontend",
        "entreprise2": "Falcong Technologie",
        "description2": "Conception et développement du site SEO optimisé et performant de Falcong Technologie avec React.js, TailwindCSS pour le style et Framer Motion pour les animations."
       
      },
      {
        "post3": "Développeur Web",
        "entreprise3": "Freelance",
        "description3": "Conception et développement d'applications et de sites web SEO optimisés et performants pour particuliers et PME, en utilisant PHP pour le backend et JavaScript/Bootstrap pour une interface fluide."
      
      }
    ]
  
}
